It works when using the main branch. 

The latest released version (2.17.0) doesn't seem to generate the public_net entry at all, while it is correctly generated in the main branch.

2.17.0:
```
  # module.kube.module.control_planes["0-0-control-plane-fsn1"].hcloud_server.server will be created
  + resource "hcloud_server" "server" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "231654384"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster"     = "lks-dev"
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
          + "role"        = "control_plane_node"
        }
      + location                   = "fsn1"
      + name                       = (known after apply)
      + placement_group_id         = (known after apply)
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cax11"
      + shutdown_before_deletion   = false
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)
      + user_data                  = (known after apply)
    }
```


main branch:
```
  # module.kube.module.control_planes["0-0-control-plane-fsn1"].hcloud_server.server will be created
  + resource "hcloud_server" "server" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "231654384"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster"     = "lks-dev"
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
          + "role"        = "control_plane_node"
        }
      + location                   = "fsn1"
      + name                       = (known after apply)
      + placement_group_id         = (known after apply)
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cax11"
      + shutdown_before_deletion   = false
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)
      + user_data                  = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.127.128.101"
          + mac_address = (known after apply)
          + network_id  = 10920571
        }

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = false
          + ipv6         = (known after apply)
          + ipv6_enabled = false
        }
    }
```